In [1]:
import pandas as pd

In [2]:
raw_data = pd.read_excel('My port\MyPoert AUG sheet1.xlsx', sheet_name=None)

In [3]:
raw_data.keys()

dict_keys(['Reunion', 'Paramaribo', 'Isle of Man', 'San Marino', 'Majuro', 'Guyana', 'Saint Kitts and Nevis', 'Guernsey', 'Cayman Islands', 'Dominica', 'Fiji', 'Greenland', 'Turks and Caicos Islands'])

In [4]:
all_dfs_list = []
for dataframe in raw_data.keys():
    raw_data[dataframe] = raw_data[dataframe].iloc[:, :2]
    raw_data[dataframe].columns = ["Trip", "Price Offer"]
    raw_data[dataframe]['Type'] = dataframe
    all_dfs_list.append(raw_data[dataframe])

In [5]:
df = pd.concat(all_dfs_list, ignore_index=True)

In [6]:
df.dropna(inplace=True)

In [7]:
df['Trip'] = df['Trip'].str.upper()
df['Price Offer'] = df['Price Offer'].str.upper()

In [11]:
df['Price Offer'] = df['Price Offer'].str.replace("\n", " ")

In [12]:
df

,Trip,Price Offer,Type
0,FROM FREDERIKSHAVN TO LIEPAJA,TRIP: ONE WAY PRICE STARTS FROM:EUR 3306,Reunion
1,FROM EMDEN TO FOS-SUR-MER,TRIP:ONE WAY PRICE START FROM :EUR 6363,Reunion
3,FROM ZEEBRUGGE TO BENSERSIEL,TRIP:ONE WAY PRICE START FROM :EUR 3666,Reunion
5,FROM EMDAN TO SAGUNTO,TRIP:ONE WAY PRICE START FROM :EUR 6166,Reunion
7,FROM EMDAN TO MILAZZO,TRIP:ONE WAY PRICE START FROM :EUR 3161,Reunion
...,...,...,...
339,FROM OOSTENDE TO FREDERIKSHAVN,TRIP:ONE WAY PRICE START FROM :RSD 66636,Turks and Caicos Islands
341,FROM OOSTENDE TO ZEEBRUGGE,TRIP:ONE WAY PRICE START FROM :RSD 66636,Turks and Caicos Islands
343,FROM OOSTENDE TO NORDERNEY,TRIP:ONE WAY PRICE START FROM :RSD 3063,Turks and Caicos Islands
345,FROM OOSTENDE TO PUTTGARDEN,TRIP:ONE WAY PRICE START FROM :RSD 61333,Turks and Caicos Islands
347,FROM OOSTENDE TO CASTELLÓN,TRIP:ONE WAY PRICE START FROM :RSD 3366,Turks and Caicos Islands